## 频道名称字典，对不同来源的频道名称进行规范统一

category_dict = {'央':'央视频道',
                 '卫':'卫视频道',
                 '影':'影视频道',
                 '儿':'少儿频道',
                 '浙':'浙江频道',
                 '广东':'广东频道',
                 '蒙':'内蒙频道'}

cctv_dict = {1:'-1 综合',2:'-2 财经',3:'-3 综艺',4:'-4 中文国际',5:'-5 体育',6:'-6 电影',
             7:'-7 国防军事',8:'-8 电视剧',9:'-9 纪录',10:'-10 科教',11:'-11 戏曲',12:'-12 社会与法',
             13:'-13 新闻',14:'-14 少儿',15:'-15 音乐',16:'-16 奥林匹克',17:'-17 农业农村',
             '5+':'-5+ 体育赛事','4K':'-4K 超高清','8K':'-8K 超高清',
             '教育':'-10 科教','新闻':'-13 新闻','少儿':'-14 少儿'}

cetv_dict = {1:'综合教育',2:'教育教学',3:'北京地面',4:'职业教育'}

province_dict = {'疆':'新疆','龙江':'黑龙江','徽':'安徽','兵':'兵团','圳':'深圳','湾':'大湾区','福建':'东南',
                 '南方':'大湾区','旅游':'海南'}

cgtn_dict = {'录':'纪录','西':'西班牙语','俄':'俄语','法':'法语','阿':'阿拉伯语','ARAB':'阿拉伯语','ESP':'西班牙语','FRA':'法语','英':'英语'}

local_lst = ['元氏','无极','高邑','栾城','井陉','赞皇','深泽','赵县','晋州','井陉','平泉','滦平','双滦','兴隆',
              '隆化','鹿泉','任县','邯山','崇礼','顺平','张北','邱县','赤城','康保','遵化','昌黎','抚宁','卢龙',
              '丰南','迁西','滦南','玉田','滦州','香河','大城','大厂','固安','文安','三河','永清','成安','魏县',
              '霸州','渤海','黄骅','孟村','东光','青县','盐山','南皮','肃宁','吴桥','丰宁','定兴','阜平','涞水',
              '满城','涞源','高碑店','涿州','唐县','曲阳','望都','定州','雄县','高阳','安新','容城','柏乡','涿鹿',
              '徐水','大名','冀州','安平','景县','饶阳','深州','武邑','阜城','故城','枣强','清河','广宗','武安',
              '宁晋','平乡','鸡泽','隆尧','广平','南和','临漳','内丘','涉县','迁安','肥乡','馆陶','乐亭','沙河',
              '曲周','南宫','丰润',] #地方频道

other_dict = {'世界地理':'CCTV-世界地理','风云足球':'CCTV-风云足球','风云音乐':'CCTV-风云音乐','中学生':'CCTV-中学生',
              # NewTv频道
            '哒啵电竞':'哒啵电竞','哒啵赛事':'哒啵赛事','黑莓动画':'黑莓动画','黑莓电影':'黑莓电影','超级电影':'超级电影',
            '超级电视剧':'超级电视剧','超级体育':'超级体育','超级综艺':'超级综艺','金牌综艺':'金牌综艺','魅力潇湘':'魅力潇湘',
            '东北热剧':'东北热剧','古装剧场':'古装剧场','欢乐剧场':'欢乐剧场','怡伴健康':'怡伴健康','潮妈辣婆':'潮妈辣婆',
            '军旅剧场':'军旅剧场','军事评论':'军事评论','中国功夫':'中国功夫','农业致富':'农业致富','动作电影':'动作电影',
            '家庭剧场':'家庭剧场','惊悚悬疑':'惊悚悬疑','炫舞未来':'炫舞未来','精品萌宠':'精品萌宠','精品体育':'精品体育',
            '精品大剧':'精品大剧','精品记录':'精品记录',
              #iHot频道
            '爱喜剧':'爱喜剧','爱科幻':'爱科幻','爱院线':'爱院线','爱浪漫':'爱浪漫','爱悬疑':'爱悬疑','爱谍战':'爱谍战',
            '爱历史':'爱历史','爱科学':'爱科学','爱幼教':'爱幼教','爱玩具':'爱玩具','爱赛车':'爱赛车','爱旅行':'爱旅行',
            '爱奇谈':'爱奇谈','爱动漫':'爱动漫','爱体育':'爱体育',
              # SMG频道（SITV）
            '五星体育':'五星体育','劲爆体育':'劲爆体育','魅力足球':'魅力足球','欢笑剧场':'欢笑剧场','法治天地':'法治天地',
            '七彩':'七彩戏剧','乐游':'乐游频道','动漫秀场':'动漫秀场','游戏风云':'游戏风云','生活时尚':'生活时尚',
            '都市剧场':'都市剧场','金色学堂':'金色学堂','第一财经':'第一财经','东方财经':'东方财经','新视觉':'新视觉',
            '上海都市':'上海都市','东方影视':'东方影视','上海纪实':'纪实人文',

            '炫动':'哈哈炫动','金鹰卡通':'金鹰卡通','金鹰纪实':'金鹰纪实','茶':'茶友频道','垂钓':'快乐垂钓',
            '晴彩青少':'晴彩青少',

            # 求索频道
            '求索纪录':'求索纪录','求索生活':'求索生活','求索动物':'求索动物','求索科学':'求索科学',

            # 影视频道
            'CHC动作':'CHC动作电影','CHC家庭':'CHC家庭影院','CHC影迷':'CHC影迷电影',

            # 河北频道
            '河北经济':'河北经济','河北都市':'河北都市','河北影视':'河北影视','河北少儿':'河北少儿科教',
            '河北公共':'河北公共','河北农民':'河北农民','河北杂技':'河北杂技','石家庄新闻综合':'石家庄新闻综合',
            '石家庄娱乐':'石家庄娱乐','石家庄生活':'石家庄生活','石家庄都市':'石家庄都市',
            '承德新闻综合':'承德新闻综合','承德公共':'承德公共',
            '张家口新闻':'张家口-1','张家口公共':'张家口-2',
            '秦皇岛新闻':'秦皇岛新闻综合','秦皇岛公共':'秦皇岛公共','秦皇岛影视':'秦皇岛影视',
            '唐山新闻':'唐山新闻综合','唐山生活':'唐山生活服务','唐山影视':'唐山影视',
            '唐山公共':'唐山公共','廊坊新闻':'廊坊新闻','廊坊公共':'廊坊公共',
            '沧州新闻综合':'沧州新闻综合','沧州公共':'沧州公共','沧州影视娱乐':'沧州影视娱乐',
            '保定新闻综合':'保定新闻综合','保定公共':'保定公共频道','保定生活':'保定生活健康',
            '衡水新闻综合':'衡水新闻综合','衡水公共':'衡水公共',
            '邢台综合':'邢台综合','邢台城市':'邢台城市生活',
            '邯郸新闻综合':'邯郸新闻综合','邯郸公共':'邯郸公共','邯郸科技教育':'邯郸科技教育',




}